# -*- coding: utf-8 -*-
# @Time    : 2025/7/31 11:22
# @Author  : wuwenxi

a = 10
b = 12
"""
    按位与
"""

print("a & b: ", a & b)

"""
    按位或
"""

print("a | b: ", a | b)

"""
    按位异或
"""

print("a ^ b: ", a ^ b)

"""
    取反
"""

print("~a: ", ~a)

"""
    按位左移
"""

print("a << 2: ", a << 2)

"""
    按位右移
"""

print("a >> 2: ", a >> 2)

'''
    负数的位运算: -10
        1. 取绝对值 10的二进制编码->00001010
        2. 取反: 11110101
        3. 取反后+1 , 11110110
        因此-10的二进制编码为0110
'''

a1 = '0b0110'
a2 = -10

a3 = 0b1010
a4 = -0b0100

print(int('0b1010', 2), int('-0b0100', 2), a3 + a4)

print(bin(a2))

print("a1: ", ~a2)
print("a1: ", bin(a2 << 2))
